app/controllers/posts_controller.rb

INSERT INTO "posts" ("post", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["post", "User Meizu wrote this post"], ["created_at", "2020-08-13 22:50:28.622576"], ["updated_at", "2020-08-13 22:50:28.622576"], ["user_id", 1]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save

UPDATE "posts" SET "post" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["post", "New post about \"Members only\" App. It was edited."], ["updated_at", "2020-08-13 23:32:11.557668"], ["id", 4]]
---
  def update
    respond_to do |format|
      if @post.update(post_params)